 # 0-იდან 20-ის ჩათვლით დაპრინტეთ ყველა მთელი რიცხვი.

for num in range(20+1):
    print(num)

#  50-იდან 100-ის ჩათვლით არსებული ყველა რიცხვი დააჯამეთ for ციკლის გამოყენებით. ეს ჯამი უნდა შეინახოს ცვლადში, ამიტომ ციკლის გარეთ შექმენით sum ცვლადი, რომელსაც ციკლში მიემატება საიტერაციო ცვლადის მნიშვნელობა. საბოლოოდ დაპტინტეთ sum ცვლადის მნიშვნელობა.


sum = 0

for num1 in range(50,100+1):
    sum = sum + num1
    
print(sum)

# -10-იდან 10-ის ჩათვლით დაატრიალეთ for ციკლი და იტერაცია მოახდინეთ 3-ით (გაიხსენეთ step), დაპრინტეთ საიტერაციო ცვლადის მნიშვნელობა ყოველ ციკლის დატრიალებაზე.

for num2 in range(-10,10+1,3):
    print(num2)

# მომხმარებელს input-ის გამოყენებით შემოატანინეთ ორი რიცხვითი მნიშვნელობა. შემდეგ if წინადადებით შეამოწმეთ რომელია უდიდესი და გამოიყენეთ for ციკლი: უმცირესიდან უდიდესამდე მოახდინეთ იტერაცია 2-ით და დაპრინტეთ ყველა მნიშვნელობა.

num3 = int(input("choose your first number"))
num4 = int(input("choose your second number"))

if num3 > num4:
    for i in range(num4 , num3, 2):
        print(i)
elif num2 > num1:
    for i in range(num3 , num4 , 2):
        print(i)
else:
    print(f"{num3}={num4}")


# მომხმარებელს input-ის გამოყენებით შემოატანინეთ ორი რიცხვითი მნიშვნელობა. შექმენით ჯამის ცვლადი ციკლის გარეთ რომლის საწყისი მნიშვნელობა იქნება 0. ციკლში start პოზიციად მომხმარებლის შემოტანილი რიცხვებიდან უმცირესი, ხოლო end პოზიციად უდიდესი აიღეთ. ციკლის მუშაობისას საიტერაციო ცვლადის მნიშვნელობა გადაეცით ჯამის ცვლადს, რათა გაიგოთ ყველა ამ რიცხვის ჯამი. საბოლოოდ დაპრინტეთ ჯამი.

num5=int(input("enter your first number: "))
num6=int(input("enter your second number: "))
sum = 0
if num5 > num6:
    for i in range(num6 , num5 + 1):
        sum += i
elif num6 > num5:
    for i in range(num5 , num6 + 1):
        sum += i 
else:
    print(f"{num5}={num6}")
print(sum)